<script setup lang="ts">
usePageTitle("Пользовательское соглашение");
import {
  COMPANY_ADDRESS,
  COMPANY_INN,
  COMPANY_NAME,
  COMPANY_OGRN,
  COMPANY_EMAIL,
  COMPANY_PHONE,
  SITE_PRETTY_ADDRESS,
} from "@/data";
const LAST_EDIT_DATE = {
  day: 19,
  month: "января",
  year: 2026,
};
</script>
<template>
  <article class="flex flex-col gap-2">
    <h1 class="title-1">Пользовательское соглашение</h1>
    <p>
      Дата последнего редактирования: {{ LAST_EDIT_DATE.day }}
      {{ LAST_EDIT_DATE.month }} {{ LAST_EDIT_DATE.year }} года
    </p>
    <p>
      Настоящее пользовательское соглашение (далее — Соглашение) определяет
      порядок и условия использования материалов и сервисов, размещённых в сети
      Интернет по адресу
      <RouterLink to="/" class="link-accent">{{
        SITE_PRETTY_ADDRESS
      }}</RouterLink>
      (далее — Сайт) Пользователями (как этот термин определён ниже) данного
      Сайта. Использование Пользователями Сайта означает, что они безоговорочно
      принимают и обязуются соблюдать все условия настоящего Соглашения.
    </p>
    <h2 class="title-2">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
    <p>
      1.1. В настоящем Соглашении, если из текста Соглашения прямо не вытекает
      иное, следующие указываемые в письменной форме с заглавной буквы слова и
      выражения, используемые при взаимодействии сторон в ходе исполнения
      обязательств, будут иметь указанные ниже значения:
    </p>
  </article>
</template>
